In [1]:
import pandas as pd
import numpy as np

In [2]:
valsl = np.array([1, None, 2, 3])
valsl

array([1, None, 2, 3], dtype=object)

In [3]:
%timeit np.arange(1E6, dtype=int).sum()

1.91 ms ± 17.7 μs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [4]:
valsl.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

In [18]:
vals2 = np.array([1, np.nan, 3, 4])
vals2

array([ 1., nan,  3.,  4.])

In [9]:
1 + np.nan

nan

In [10]:
0 * np.nan

nan

In [11]:
vals2.sum(), vals2.min(), vals2.max()

(np.float64(nan), np.float64(nan), np.float64(nan))

In [16]:
np.isnan(vals2).all()

np.False_

In [17]:
np.nansum(vals2), np.nanmin(vals2), np.nanmax(vals2)

(np.float64(13.0), np.float64(1.0), np.float64(5.0))

In [26]:
pd.DataFrame(
    [
        [1, np.nan, 2, None],
             [1, np.nan, 2, None],
             [1, np.nan, 2, None],
             [1, np.nan, 2, None],
    ],
             index=['sapporo', 'tokyo', 'oosaka', 'okinawa'],
             columns=['0', '1', '2', '3']
)

         0   1  2     3
sapporo  1 NaN  2  None
tokyo    1 NaN  2  None
oosaka   1 NaN  2  None
okinawa  1 NaN  2  None

In [27]:
x = pd.Series(range(2), dtype=int)
x

0    0
1    1
dtype: int64

In [30]:
x[0] = None
x

0    NaN
1    1.0
dtype: float64

In [31]:
pd.Series([1, np.nan, 2, None, pd.NA], dtype='Int32')

0       1
1    <NA>
2       2
3    <NA>
4    <NA>
dtype: Int32

In [32]:
data = pd.Series([1, np.nan, 'hello', None])

In [33]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [34]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [35]:
data[data.isnull()]

1     NaN
3    None
dtype: object

In [36]:
data.dropna()

0        1
2    hello
dtype: object

In [38]:
df = pd.DataFrame([[1,    np.nan, 2],
                [2,     3,     5],
                [np.nan, 4,    6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [39]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [44]:
df.dropna(axis=1)  #又は(axis='columns')

   2
0  2
1  5
2  6

In [45]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [46]:
df.dropna(axis='columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [47]:
df.dropna(axis='rows', thresh=3)

     0    1  2   3
1  2.0  3.0  5 NaN

In [48]:
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'),
                 dtype='Int32')
data

a       1
b    <NA>
c       2
d    <NA>
e       3
dtype: Int32

In [49]:
data.fillna(0)

a    1
b    0
c    2
d    0
e    3
dtype: Int32

In [50]:
data.fillna(method='ffill')

C:\Users\Ryouh\AppData\Local\Temp\ipykernel_18624\1844443866.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='ffill')

a    1
b    1
c    2
d    2
e    3
dtype: Int32

In [51]:
data.fillna(method='bfill')

C:\Users\Ryouh\AppData\Local\Temp\ipykernel_18624\1397359497.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method='bfill')

a    1
b    2
c    2
d    3
e    3
dtype: Int32

In [52]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [53]:
df.fillna(method='ffill', axis=1)

C:\Users\Ryouh\AppData\Local\Temp\ipykernel_18624\901808322.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', axis=1)

     0    1    2    3
0  1.0  1.0  2.0  2.0
1  2.0  3.0  5.0  5.0
2  NaN  4.0  6.0  6.0